# [01]

In [ ]:
안녕하세요. 이세무사입니다.
엑셀로는 뭔가 부족하거나 번거롭다고 느끼지만
프로그래밍 언어를 배우는것은 좀 오버인것 같다고 생각하시는 분들에게 도움이 될듯합니다.
파이썬 문법을 따로배우지 않고 파이썬의 pandas라이브러리만을 주로 이용해서
엑셀에 있는 데이터를 가공하겠습니다.
강의를 보고 쓸만하다고 판단되면 컴퓨터에 파이썬을 설치하시면 됩니다.
쥬피터노트북 설치는 포털에서 검색하시면 될거 같습니다.

In [4]:
import pandas as pd
import easygui

# 엑셀자료를 가져오기전에 표형식의 자료를 파이썬에서 한번 만들어보겠습니다.
# 동아리 회원 표를 만든다고 생각해보겠습니다.
인원리스트 = [[i,i+1,i+2,i+3] for i in range(1,18,4)]

In [76]:
인원리스트

[[1, 2, 3, 4],
 [5, 6, 7, 8],
 [9, 10, 11, 12],
 [13, 14, 15, 16],
 [17, 18, 19, 20]]

In [79]:
시프레임 = pd.DataFrame(인원리스트, columns=['최', '박', '이', '김'], 
                       index=['수원', '화성', '용인', '청주', '충주'])

In [80]:
시프레임

     최   박   이   김
수원   1   2   3   4
화성   5   6   7   8
용인   9  10  11  12
청주  13  14  15  16
충주  17  18  19  20

In [81]:
시프레임.sum()

최    45
박    50
이    55
김    60
dtype: int64

In [40]:
시프레임.sum().to_frame('city')

   city
최    45
박    50
이    55
김    60

In [41]:
시프레임.sum(axis=1)

수원    10
화성    26
용인    42
청주    58
충주    74
dtype: int64

In [82]:
시프레임.sum(axis=1).to_frame('총인원')

    총인원
수원   10
화성   26
용인   42
청주   58
충주   74

In [13]:
if 0:
    filename1 = easygui.fileopenbox()
elif 0 :
    filename1 = 'C:\\Users\\hana1602a\\Documents\\excel_python\\엑셀과코딩사이.xlsx' #C:\excel_python
else :
    filename1 = '~\\excel_python\\엑셀과코딩사이.xlsx'

In [14]:
filename1

'~\\excel_python\\엑셀과코딩사이.xlsx'

In [15]:
workbook1 = pd.ExcelFile(filename1)
df0 = workbook1.parse(sheetname=0)
#df0 = workbook1.parse(sheetname=0, index_col=0)

In [16]:
df0

    시   최   박   이   김
0  수원   1   2   3   4
1  화성   5   6   7   8
2  용인   9  10  11  12
3  청주  13  14  15  16
4  충주  17  18  19  20

In [8]:
df0 = df0.set_index('시')

In [9]:
df0

     최   박   이   김
시
수원   1   2   3   4
화성   5   6   7   8
용인   9  10  11  12
청주  13  14  15  17
충주  18  19  20  21

In [11]:
#오늘은 여기까지입니다.

# [02]

In [ ]:
엑셀에 vba 앱이 있어서 몇년간 써왔었는데요
데이터 포맷이 변경이 되면 코드를 매번 수정해야해서
가성비가 좋은편은 아닙니다.
전편에 이어 하도록 하겠습니다.
우리가 문법은 안배워도 질문하는 방법은 배워야합니다.
익숙해질때까지 연습이 필요합니다.

In [106]:
import pandas as pd
filename1 = '~\\documents\\excel_python\\엑셀과코딩사이.xlsx' # 지난번에는 팝업창이용했지만 이제는 어디있는지 아니까 바로 쓰겠습니다'
workbook1 = pd.ExcelFile(filename1)
df0 = workbook1.parse(sheetname=0) # 엑셀화일 시트를 보여주기

In [107]:
df0 # 숫자가 index

    시   최   박   이   김
0  수원   1   2   3   4
1  화성   5   6   7   8
2  용인   9  10  11  12
3  청주  13  14  15  16
4  충주  17  18  19  20
5  천안  21  22  23  24

In [108]:
df0 = workbook1.parse(sheetname=0, header=None) #첫번째 행을 칼럼으로 쓰고싶지 않다면 이렇게 하면 됩니다.

In [109]:
df0

    0   1   2   3   4
0   시   최   박   이   김
1  수원   1   2   3   4
2  화성   5   6   7   8
3  용인   9  10  11  12
4  청주  13  14  15  16
5  충주  17  18  19  20
6  천안  21  22  23  24

In [110]:
df0 = workbook1.parse(sheetname=0, index_col=0) 
# 이전처럼 set_index를 써도 되고 파싱할때 인덱스를 지정할수 있습니다
# 도시명이 인덱스고 성씨가 칼럼입니다.

In [111]:
df0

     최   박   이   김
시
수원   1   2   3   4
화성   5   6   7   8
용인   9  10  11  12
청주  13  14  15  16
충주  17  18  19  20
천안  21  22  23  24

In [112]:
df0.values.tolist() #프레임에 값만 추출하면 데이터를 직접 생성했을때와 비슷합니다

[[1, 2, 3, 4],
 [5, 6, 7, 8],
 [9, 10, 11, 12],
 [13, 14, 15, 16],
 [17, 18, 19, 20],
 [21, 22, 23, 24]]

In [113]:
[list(range(i,i+4)) for i in range(1,22,4)] # 저번수업때 봤던건데 알필요는 없습니다

[[1, 2, 3, 4],
 [5, 6, 7, 8],
 [9, 10, 11, 12],
 [13, 14, 15, 16],
 [17, 18, 19, 20],
 [21, 22, 23, 24]]

In [114]:
df0.columns

Index(['최', '박', '이', '김'], dtype='object')

In [115]:
df0.index

Index(['수원', '화성', '용인', '청주', '충주', '천안'], dtype='object', name='시')

In [116]:
df0.sum()

최    66
박    72
이    78
김    84
dtype: int64

In [117]:
df0.sum(axis=1)

시
수원    10
화성    26
용인    42
청주    58
충주    74
천안    90
dtype: int64

In [118]:
df1 = workbook1.parse(sheetname=1, index_col=0) # 엑셀화일 시트를 보여주기

In [119]:
df1

     도
시
수원  경기
화성  경기
용인  경기
청주  충북
충주  충북
천안  충남

In [120]:
df01 = df0.join(df1) # 두 프레임을 성씨를 기준으로 조인하겠습니다.

In [121]:
df01

     최   박   이   김   도
시
수원   1   2   3   4  경기
화성   5   6   7   8  경기
용인   9  10  11  12  경기
청주  13  14  15  16  충북
충주  17  18  19  20  충북
천안  21  22  23  24  충남

In [122]:
df01=df01.reset_index().set_index(['도','시']) # 도와 시를 인덱스로 하겠습니다.

In [123]:
df01

        최   박   이   김
도  시
경기 수원   1   2   3   4
   화성   5   6   7   8
   용인   9  10  11  12
충북 청주  13  14  15  16
   충주  17  18  19  20
충남 천안  21  22  23  24

# [03]

In [1]:
import pandas as pd
filename1 = '~\\documents\\excel_python\\엑셀과코딩사이.xlsx' # 지난번에는 팝업창이용했지만 이제는 어디있는지 아니까 바로 쓰겠습니다'
workbook1 = pd.ExcelFile(filename1)
df0 = workbook1.parse(sheetname=0, index_col=0) # 엑셀화일 시트를 보여주기
df1 = workbook1.parse(sheetname=1, index_col=0) # 엑셀화일 시트를 보여주기
df01 = df0.join(df1) # 두 프레임을 성씨를 기준으로 조인하겠습니다.

In [2]:
df01

     최   박   이   김   도
시
수원   1   2   3   4  경기
화성   5   6   7   8  경기
용인   9  10  11  12  경기
청주  13  14  15  16  충북
충주  17  18  19  20  충북
천안  21  22  23  24  충남

In [124]:
'''여기서 잠깐 쥬피터노트북이 프레임을 시인성있게 잘 보여주는데
데이터프레임의 사이즈가 크면 쥬피터노트북에서는 열과 행을 생략해서 보여줍니다.
이럴 경우에는 엑셀로 확인하면 편합니다.
사이즈가 큰 데이터프레임을 엑셀화일로 저장해서 확인할수 있지만
최종생산물이 아닌 데이터를 체크할 목적이면 클립보드를 이용해 복붙해서 활용하는게 편합니다.'''

'여기서 잠깐 쥬피터노트북이 프레임을 시인성있게 잘 보여주는데\n데이터프레임의 사이즈가 크면 쥬피터노트북에서는 열과 행을 생략해서 보여줍니다.\n이럴 경우에는 엑셀로 확인하면 편합니다.\n사이즈가 큰 데이터프레임을 엑셀화일로 저장해서 확인할수 있지만\n최종생산물이 아닌 데이터를 체크할 목적이면 클립보드를 이용해 복붙해서 활용하는게 편합니다.'

In [125]:
pd.DataFrame([list(range(i,i+40)) for i in range(1,100,40)]) #열이 40개인 프레임을 만들었습니다.

,0,1,2,3,4,5,6,7,8,9,...,30,31,32,33,34,35,36,37,38,39
0,1,2,3,4,5,6,7,8,9,10,...,31,32,33,34,35,36,37,38,39,40
1,41,42,43,44,45,46,47,48,49,50,...,71,72,73,74,75,76,77,78,79,80
2,81,82,83,84,85,86,87,88,89,90,...,111,112,113,114,115,116,117,118,119,120

In [126]:
pd.DataFrame([list(range(i,i+40)) for i in range(1,100,40)]).to_clipboard() #붙여넣기 보여주기

In [127]:
df01.to_clipboard() # 클립보드 내용을 엑셀에 붙여넣었을때와 쥬피터노트북 결과물을 복사해서 붙여넣기 비교

In [128]:
df01.loc['경기'] #이제 원하는 자료를 추출해 보겠습니다. 인덱스기준으로 검색할때는 loc메서드를 씁니다.

    최   박   이   김
시
수원  1   2   3   4
화성  5   6   7   8
용인  9  10  11  12

In [129]:
df01.loc[('경기','수원')].to_frame()

  경기
  수원
최  1
박  2
이  3
김  4

In [130]:
df01.loc[('경기','수원'),'김']

4

In [131]:
df01.sum().to_frame('인원')

   인원
최  66
박  72
이  78
김  84

In [132]:
df01.sum(axis=1).to_frame('인원')

       인원
도  시
경기 수원  10
   화성  26
   용인  42
충북 청주  58
   충주  74
충남 천안  90

In [133]:
df01.loc['경기']

    최   박   이   김
시
수원  1   2   3   4
화성  5   6   7   8
용인  9  10  11  12

In [134]:
df01.loc['경기'].sum()

최    15
박    18
이    21
김    24
dtype: int64

In [135]:
df01.loc['경기'].sum().to_frame('경기도')

   경기도
최   15
박   18
이   21
김   24

In [136]:
df01.loc['경기'].sum(axis=1)

시
수원    10
화성    26
용인    42
dtype: int64

In [137]:
df01.loc['경기'].sum(axis=1).to_frame('경기도')

    경기도
시
수원   10
화성   26
용인   42

# [04]

In [138]:
df01.iloc[0:2].sum(axis=1).to_frame('인원') #iloc메서드는 인덱스의 위치를 기준으로 검색합니다.

       인원
도  시
경기 수원  10
   화성  26

In [139]:
df01.loc[:,'김'].to_frame()

        김
도  시
경기 수원   4
   화성   8
   용인  12
충북 청주  16
   충주  20
충남 천안  24

In [140]:
df01.loc[:,('김','이')]

        김   이
도  시
경기 수원   4   3
   화성   8   7
   용인  12  11
충북 청주  16  15
   충주  20  19
충남 천안  24  23

In [141]:
df01.loc[:,'박':'김']

        박   이   김
도  시
경기 수원   2   3   4
   화성   6   7   8
   용인  10  11  12
충북 청주  14  15  16
   충주  18  19  20
충남 천안  22  23  24

In [142]:
df01[['김','이']] # loc 메서드는 주로 인덱스로 필터링할때 쓰는데 칼럼기준으로 필터링할거면 loc 안써도됨

        김   이
도  시
경기 수원   4   3
   화성   8   7
   용인  12  11
충북 청주  16  15
   충주  20  19
충남 천안  24  23

In [143]:
df01[df01.isin([10,20])].dropna(how='all') #값들중에 속하는 값이 있으면 출력

        최     박   이     김
도  시
경기 용인 NaN  10.0 NaN   NaN
충북 충주 NaN   NaN NaN  20.0

In [144]:
칠의배수 = [7,14]
df01[df01.isin(칠의배수)].dropna(how='all')

        최     박    이   김
도  시
경기 화성 NaN   NaN  7.0 NaN
충북 청주 NaN  14.0  NaN NaN

In [145]:
df01[df01.index.isin([('경기','화성')])]

       최  박  이  김
도  시
경기 화성  5  6  7  8

In [146]:
df01.unstack(1) # 언스택은 인덱스를 칼럼으로 옮기는 함수입니다. 1은 두번째인 시 인덱스인입니다.

      최                                박                   ...      이        \
시    수원   용인    천안    청주    충주   화성   수원    용인    천안    청주 ...     천안    청주
도                                                          ...
경기  1.0  9.0   NaN   NaN   NaN  5.0  2.0  10.0   NaN   NaN ...    NaN   NaN
충남  NaN  NaN  21.0   NaN   NaN  NaN  NaN   NaN  22.0   NaN ...   23.0   NaN
충북  NaN  NaN   NaN  13.0  17.0  NaN  NaN   NaN   NaN  14.0 ...    NaN  15.0

                 김
시     충주   화성   수원    용인    천안    청주    충주   화성
도
경기   NaN  7.0  4.0  12.0   NaN   NaN   NaN  8.0
충남   NaN  NaN  NaN   NaN  24.0   NaN   NaN  NaN
충북  19.0  NaN  NaN   NaN   NaN  16.0  20.0  NaN

[3 rows x 24 columns]

In [147]:
df01.unstack(1).sum(axis=1).to_frame('인원')

       인원
도
경기   78.0
충남   90.0
충북  132.0

In [148]:
df01.unstack(1).sum().to_frame('인원') #축을 바꿔서 합계하면

        인원
  시
최 수원   1.0
  용인   9.0
  천안  21.0
  청주  13.0
  충주  17.0
  화성   5.0
박 수원   2.0
  용인  10.0
  천안  22.0
  청주  14.0
  충주  18.0
  화성   6.0
이 수원   3.0
  용인  11.0
  천안  23.0
  청주  15.0
  충주  19.0
  화성   7.0
김 수원   4.0
  용인  12.0
  천안  24.0
  청주  16.0
  충주  20.0
  화성   8.0

In [149]:
df01.unstack(0) #도 인덱스를 언스택하겠습니다.

      최                 박                 이                 김
도    경기    충남    충북    경기    충남    충북    경기    충남    충북    경기    충남    충북
시
수원  1.0   NaN   NaN   2.0   NaN   NaN   3.0   NaN   NaN   4.0   NaN   NaN
용인  9.0   NaN   NaN  10.0   NaN   NaN  11.0   NaN   NaN  12.0   NaN   NaN
천안  NaN  21.0   NaN   NaN  22.0   NaN   NaN  23.0   NaN   NaN  24.0   NaN
청주  NaN   NaN  13.0   NaN   NaN  14.0   NaN   NaN  15.0   NaN   NaN  16.0
충주  NaN   NaN  17.0   NaN   NaN  18.0   NaN   NaN  19.0   NaN   NaN  20.0
화성  5.0   NaN   NaN   6.0   NaN   NaN   7.0   NaN   NaN   8.0   NaN   NaN

In [150]:
df01.unstack(0).sum(axis=1).to_frame('인원')

      인원
시
수원  10.0
용인  42.0
천안  90.0
청주  58.0
충주  74.0
화성  26.0

In [151]:
df01.unstack(0).sum().to_frame('인원')

        인원
  도
최 경기  15.0
  충남  21.0
  충북  30.0
박 경기  18.0
  충남  22.0
  충북  32.0
이 경기  21.0
  충남  23.0
  충북  34.0
김 경기  24.0
  충남  24.0
  충북  36.0

In [152]:
df01.T

도 경기         충북      충남
시 수원 화성  용인  청주  충주  천안
최  1  5   9  13  17  21
박  2  6  10  14  18  22
이  3  7  11  15  19  23
김  4  8  12  16  20  24

In [153]:
df01.T.sum().to_frame('인원')

       인원
도  시
경기 수원  10
   화성  26
   용인  42
충북 청주  58
   충주  74
충남 천안  90

In [154]:
#df01 = df01.reset_index()

In [155]:
df01

        최   박   이   김
도  시
경기 수원   1   2   3   4
   화성   5   6   7   8
   용인   9  10  11  12
충북 청주  13  14  15  16
   충주  17  18  19  20
충남 천안  21  22  23  24

In [156]:
df01.groupby(level='도').sum() #그룹연산에 대해 알아보겠습니다. 그룹바이 메서드

     최   박   이   김
도
경기  15  18  21  24
충남  21  22  23  24
충북  30  32  34  36

In [157]:
df01.loc['경기'] #하지마

    최   박   이   김
시
수원  1   2   3   4
화성  5   6   7   8
용인  9  10  11  12

In [158]:
df01.groupby((df01.columns), axis=1).sum() #axis? 하지마

        김   박   이   최
도  시
경기 수원   4   2   3   1
   화성   8   6   7   5
   용인  12  10  11   9
충북 청주  16  14  15  13
   충주  20  18  19  17
충남 천안  24  22  23  21

In [159]:
df01.groupby(level='도')['김'].sum()

도
경기    24
충남    24
충북    36
Name: 김, dtype: int64

In [160]:
df01.groupby(level='시').sum()

     최   박   이   김
시
수원   1   2   3   4
용인   9  10  11  12
천안  21  22  23  24
청주  13  14  15  16
충주  17  18  19  20
화성   5   6   7   8

In [161]:
df01.groupby(level=['도','시']).sum() # sum이 의미없지만

        최   박   이   김
도  시
경기 수원   1   2   3   4
   용인   9  10  11  12
   화성   5   6   7   8
충남 천안  21  22  23  24
충북 청주  13  14  15  16
   충주  17  18  19  20

In [162]:
df01.groupby(level=['시','도']).sum()

        최   박   이   김
시  도
수원 경기   1   2   3   4
용인 경기   9  10  11  12
천안 충남  21  22  23  24
청주 충북  13  14  15  16
충주 충북  17  18  19  20
화성 경기   5   6   7   8

In [163]:
df01.groupby(level=['도'])['김','이'].agg(['sum','max']) # 김씨가 제일만은 시의 인원

     김       이
   sum max sum max
도
경기  24  12  21  11
충남  24  24  23  23
충북  36  20  34  19

In [164]:
df01.groupby(level=['도'])['김','이'].agg(['sum','mean'])

     김        이
   sum mean sum mean
도
경기  24    8  21    7
충남  24   24  23   23
충북  36   18  34   17

In [165]:
df01

        최   박   이   김
도  시
경기 수원   1   2   3   4
   화성   5   6   7   8
   용인   9  10  11  12
충북 청주  13  14  15  16
   충주  17  18  19  20
충남 천안  21  22  23  24

In [166]:
df01rs = df01.reset_index()

In [167]:
df01rs # 도와 시를 인덱스로 하지 않아도 필터링 가능합니다.

    도   시   최   박   이   김
0  경기  수원   1   2   3   4
1  경기  화성   5   6   7   8
2  경기  용인   9  10  11  12
3  충북  청주  13  14  15  16
4  충북  충주  17  18  19  20
5  충남  천안  21  22  23  24

In [172]:
df01rs.sum().to_frame('인원')

             인원
도  경기경기경기충북충북충남
시  수원화성용인청주충주천안
최            66
박            72
이            78
김            84

In [175]:
df01rs.sum(axis=1).to_frame()

    0
0  10
1  26
2  42
3  58
4  74
5  90

In [176]:
df01rs[df01rs['도'].isin(['경기'])]

    도   시  최   박   이   김
0  경기  수원  1   2   3   4
1  경기  화성  5   6   7   8
2  경기  용인  9  10  11  12

In [177]:
df01rs[df01rs['시'].isin(['화성','청주'])]

    도   시   최   박   이   김
1  경기  화성   5   6   7   8
3  충북  청주  13  14  15  16